app/Http/Controllers/HomeController.php

    public function index()
    {

        $trservices = Service::limit(3)->get();
        $srservices = Service::limit(8)->get();
        $services = Service::select('id', 'nom')->get();
---
select * from `services` limit 3
select * from `services` limit 8
select `id`, `nom` from `services`

    public function dashboard()
    {
        if (Auth()->user()->role == 'Client') {
            $services = Service::get()->take(4);
            return view('dashboard', compact('services'));
        }

        elseif(Auth()->user()->role == 'Tacheur'){
            $totalSolde = Tacheur::where('id', auth()->user()->tacheur->id)->sum('solde');
            $todaySolde = Tacheur::where('id', auth()->user()->tacheur->id)
                    ->whereDate('created_at', today())
                    ->sum('solde');

            $tacheurservicesid = TacheurService::where('tacheur_id', Auth()->user()->tacheur->id)->pluck('id');
            $servicesCount = Travail::whereNotNull('finTravail')->where('tacheur_service_id', $tacheurservicesid)->count();

            $servicesIds = TacheurService::where('tacheur_id', Auth()->user()->tacheur->id)->pluck('service_id');
            $tonservice = TacheurService::with('service')->where('service_id', $servicesIds)->first();

            $travails = Travail::whereIn('tacheur_service_id', $tacheurservicesid)->get();
---
select sum(`solde`) as aggregate from `tacheurs` where `id` = 1
select sum(`solde`) as aggregate from `tacheurs` where `id` = 1 and date(`created_at`) = '2024-08-02'
select `id` from `tacheur_services` where `tacheur_id` = 1
select count(*) as aggregate from `travails` where `finTravail` is not null and `tacheur_service_id` = 1
select `service_id` from `tacheur_services` where `tacheur_id` = 1
select * from `services` where `services`.`id` in (1)
select * from `tacheur_services` where `service_id` = 1 limit 1
select * from `travails` where `tacheur_service_id` in (1)